import requests, json
from utils.translator import translate
from textblob import TextBlob



if __name__ == "_main__":

    collection = requests.get("http://users.ics.forth.gr/mountant/files/greek.json").text

    data = json.loads(collection)
    for x in data["data"]:
        paragraphs=x["paragraphs"]
        
        for y in paragraphs:
            greek_context = y['context']
            
            print("Greek Text: ")
            print(greek_context)

            print("Translated Text: ")

            print('\tGoogle:')
            print(translate(greek_context, "google", "el", "en"))

            print('\tHelsinki:')
            print(translate(greek_context, "helsinki", "el", "en"))

            print('\tGoslate:')
            print(translate(greek_context, "goslate", "el", "en"))

            print('\tTextblob:')
            print(translate(greek_context, "textblob", "el", "en"))

input = 'Ο Καζαντζάκης ταξίδεψε πολύ στη ζωή του: Νάξος, Αθήνα, Παρίσι, Άγιον Όρος, Καύκασος, Βιέννη, Βερολίνο, Ιταλία, Κύπρος, Παλαιστίνη, Ιαπωνία, Ισπανία, Τσεχοσλοβακία, Αγγλία, Γαλλία, Ολλανδία, Γερμανία, Αυστρία, Γιουγκοσλαβία και αλλού.Το 1922 επισκέφτηκε τη Βιέννη, όπου ήρθε σε επαφή με το έργο του Σίγκμουντ Φρόυντ και τις βουδιστικές γραφές. Επισκέφτηκε ακόμη τη Γερμανία, ενώ το 1924 έμεινε για τρεις μήνες στην Ιταλία. Την περίοδο 1923–1926 πραγματοποίησε επίσης αρκετά δημοσιογραφικά ταξίδια στη Σοβιετική Ένωση, την Παλαιστίνη, την Κύπρο και την Ισπανία, όπου του παραχώρησε συνέντευξη ο δικτάτορας Πρίμο ντε Ριβέρα.[1] Τον Οκτώβριο του 1926 πήγε στη Ρώμη και πήρε συνέντευξη από τον Μπενίτο Μουσολίνι.[1] Επίσης, εργάστηκε ως ανταποκριτής των εφημερίδων Ακρόπολις, Ελεύθερος Λόγος, Ελεύθερος Τύπος, Η Καθημερινή κ.ά.[10] Είχε, βέβαια, γνωριστεί με την Ελένη Σαμίου, το 1924 (το διαζύγιο με την Γαλάτεια εκδόθηκε το 1926), με την οποία έζησε 21 χρόνια χωρίς γάμο. Παντρεύτηκαν το 1945 κι αυτό γιατί με τον καλό του φίλο, τον Άγγελο Σικελιανό και τη δεύτερη γυναίκα του, θα πήγαιναν στις ΗΠΑ. Το 1925 ο Καζαντζάκης συνελήφθη στο Ηράκλειο της Κρήτης, αλλά κρατήθηκε μόνο για είκοσι τέσσερις ώρες, επειδή από το 1924 είχε αναλάβει την πνευματική ηγεσία μιας κομμουνιστικής οργάνωσης δυσαρεστημένων προσφύγων και παλαιμάχων από τη Μικρασιατική εκστρατεία.[1] Σαυτό το επεισόδιο αναφέρεται ο Παντελής Πρεβελάκης και η Έλλη Αλεξίου.[15] Το 1927 ξεκίνησε την ανθολογία των ταξιδιωτικών του άρθρων για την έκδοση του πρώτου τόμου του Ταξιδεύοντας, ενώ το περιοδικό Αναγέννηση, του Δημήτρη Γληνού, δημοσίευσε την Ασκητική, το φιλοσοφικό του έργο. Τον Οκτώβριο του 1927, ο Καζαντζάκης, όντας αριστερός, έφυγε για τη Μόσχα προσκεκλημένος από την κυβέρνηση της Σοβιετικής Ένωσης, για να πάρει μέρος στις γιορτές για τα δεκάχρονα της Οκτωβριανής Επανάστασης. Εκεί γνωρίστηκε με τον ομοϊδεάτη, αριστερό Ελληνορουμάνο λογοτέχνη, Παναΐτ Ιστράτι,[16] μαζί με τον οποίον επέστρεψε στην Ελλάδα. Τον Ιανουάριο του 1928 στο θέατρο «Αλάμπρα», στην Αθήνα, μίλησαν εξυμνώντας τη Σοβιετική Ένωση, ο Καζαντζάκης και ο Ιστράτι. Στο τέλος της ομιλίας έγινε και διαδήλωση. Τόσο ο Καζαντζάκης όσο και ο συνδιοργανωτής της εκδήλωσης Δημήτρης Γληνός διώχθηκαν δικαστικά. Η δίκη ορίσθηκε στις 3 Απριλίου, αναβλήθηκε μερικές φορές και δεν έγινε ποτέ. Τον Απρίλιο, ο Καζαντζάκης, ξαναβρέθηκε στη Ρωσία, όπου γράφει ένα κινηματογραφικό σενάριο για το ρωσικό κινηματογράφο με θέμα από τη Ελληνική Επανάσταση του 1821, Το Κόκκινο Μαντήλι.[12] Τον Μάιο του 1929 απομονώθηκε σε ένα αγρόκτημα στην Τσεχοσλοβακία, όπου ολοκλήρωσε στα Γαλλικά τα μυθιστορήματα Τόντα-Ράμπα (Toda-Raba, μετονομασία του αρχικού τίτλου Moscou a crié) και Kapétan Élia. Τα έργα αυτά εντάσσονταν στην προσπάθεια του Καζαντζάκη να καταξιωθεί διεθνώς ως συγγραφέας. Η γαλλική έκδοση του μυθιστορήματος Toda-Raba έγινε με το ψευδώνυμο Nikolaï Kazan. Το 1930 θα δικαζόταν, πάλι, ο Καζαντζάκης για αθεϊσμό, για την Ασκητική. Η δίκη ορίσθηκε για τις 10 Ιουνίου, αλλά κι αυτή δεν έγινε ποτέ.'

print(len(input), " ",translate(input, "helsinki", "el", "en"))